
#Область ПрограммныйИнтерфейс

// Возвращает данные по операциям за период.
//	См. ТинькоффApiСервер.ПолучитьОперацииЗаПериод().
//
// Параметры:
//  Сессия  - Структура - Сессия, см. ТинькоффApi.НоваяСессия().
//  ОписаниеОповещения  - ОписаниеОповещения - Содержит описание процедуры, которая будет вызвана выполнения авторизации.
//  НачалоПериода  - Дата - Начало периода, за который запрашиваются операции.
//  КонецПериода  - Дата - Конец периода, за который запрашиваются операции.
//
Процедура ПолучитьОперацииЗаПериод(Сессия, ОписаниеОповещения, НачалоПериода, КонецПериода) Экспорт

	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("Сессия", Сессия);
	//ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	//ДополнительныеПараметры.Вставить("НачалоПериода", НачалоПериода);
	//ДополнительныеПараметры.Вставить("КонецПериода", КонецПериода);
	//
	//Если Сессия = Неопределено Тогда
	//
	//	ОписаниеОповещенияПродолжение = Новый ОписаниеОповещения("ПолучитьОперацииЗаПериодПродолжение", 
	//		ЭтотОбъект, ДополнительныеПараметры);
	//
	//    Авторизация(ОписаниеОповещенияПродолжение);
	//Иначе
	//	
	//	ПолучитьОперацииЗаПериодПродолжение(ДополнительныеПараметры);		
	//	
	//КонецЕсли; 

КонецПроцедуры

// Выполняет подтверждение входа.
//	Вызывается после ввода кода подтверждения входа.
//
// Параметры:
//  Значение  - Строка - Введенный код подтверждения.
//  ДополнительныеПараметры  - Структура - Параметры, обязательные:
//		* ОписаниеОповещения - ОписаниеОповещения - Процедура, которая будет вызвана после подтверждения входа.
//
Процедура ПолучитьОперацииЗаПериодПродолжение(ДополнительныеПараметры = Неопределено) Экспорт
	
	Операции = ТинькоффApiВызовСервера.ПолучитьОперацииЗаПериод(ДополнительныеПараметры.Сессия, 
		ДополнительныеПараметры.НачалоПериода, ДополнительныеПараметры.КонецПериода); 
		
	ДополнительныеПараметры.Вставить("Операции", Операции);
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, ДополнительныеПараметры);
		
КонецПроцедуры

// Выполняет авторизацию и 
//	Если используется подтверждение входа по коду СМС, то будет предложено ввести код.
//
// Параметры:
//  ОписаниеОповещения  - ОписаниеОповещения - Содержит описание процедуры, которая будет вызвана после авторизации.
//  ИмяПользователя  - Строка - ИмяПользователя.
//  Пароль  - Строка - Пароль.
//
Процедура Авторизация(ОписаниеОповещения, ИмяПользователя, Пароль) Экспорт
	
	Перем Сессия;
	
	ТинькоффApiВызовСервера.ВыполнитьАвторизацию(Сессия, ИмяПользователя, Пароль);

	Если Сессия.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сессия.ТекстОшибки);
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Сессия", Сессия); 
	
	Если Сессия.ПодтверждениеВхода Тогда
	
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(4));
		
		ДополнительныеПараметры.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ОписаниеОповещенияПродолжение = Новый ОписаниеОповещения("АвторизацияПродолжение", 
			ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводЗначения(ОписаниеОповещенияПродолжение, "0000", "Введите код подтверждения", ОписаниеТипаСтрока);  
		
	Иначе
		АвторизацияЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет подтверждение входа.
//	Вызывается после ввода кода подтверждения входа.
//
// Параметры:
//  Значение  - Строка - Введенный код подтверждения.
//  ДополнительныеПараметры  - Структура - Параметры, обязательные:
//		* ОписаниеОповещения - ОписаниеОповещения - Процедура, которая будет вызвана после подтверждения входа.
//
Процедура АвторизацияПродолжение(Значение, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТинькоффApiВызовСервера.ПодтвердитьАвторизацию(ДополнительныеПараметры.Сессия, Значение);
	Если ДополнительныеПараметры.Сессия.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДополнительныеПараметры.Сессия.ТекстОшибки);
		Возврат;
	КонецЕсли; 
	
	АвторизацияЗавершение(ДополнительныеПараметры);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура АвторизацияЗавершение(ДополнительныеПараметры = Неопределено)
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, ДополнительныеПараметры.Сессия);
	
КонецПроцедуры

#КонецОбласти
